In [90]:
import pandas as pd
import numpy as np

marin = pd.read_csv('../data/intermediate/Max_Animals_MARIN_data.csv', index_col=0)
marin['Sampling Period'] = marin['Sampling Period'].apply(lambda x: str(x).replace('.', '-'))
marin['Year'] = marin['Sampling Period'].apply(lambda x: x[0:4])

In [91]:
marin.head()

,Sampling Period,Project ID_x,Deployment Location ID,Species,Number of Animals,Year
0,2014-09,ChedaJewel,WW63,fuscipes,1,2014
1,2014-09,ChedaJewel,WW63,griseus,1,2014
2,2014-09,ChedaJewel,WW63,hemionus,2,2014
3,2014-09,ChedaJewel,WW63,lotor,1,2014
4,2014-09,ChedaJewel,WW63,maniculatus,1,2014

In [92]:
lat_long = pd.read_csv('../data/intermediate/Marin_Merged.csv', index_col=0)
lat_long = lat_long[['Deployment.Location.ID', 'Latitude.Resolution', 'Longitude.Resolution']] 
lat_long = lat_long.rename(columns = {'Deployment.Location.ID':'Deployment Location ID',
                 'Latitude.Resolution': 'Latitude', 
                 'Longitude.Resolution': 'Longitude'})
lat_long = lat_long.drop_duplicates('Deployment Location ID').reset_index()
del lat_long['index']

In [93]:
lat_long.head()

  Deployment Location ID   Latitude   Longitude
0                   WW64  38.038821 -122.749029
1                   XX63  38.043090 -122.743715
2                   WW63  38.043094 -122.749595
3                   WW65  38.034152 -122.749170
4                   XX64  38.038710 -122.743536

In [94]:
marin = pd.merge(marin, lat_long, on=['Deployment Location ID'], how='left')
marin['Data Source'] = 'MARIN'

In [95]:
rate.head()

   Unnamed: 0  Project.ID Deployment.Location.ID    Month  Trapnights
0           0  ChedaJewel                   WW63  2014-10          31
1           1  ChedaJewel                   WW63  2014-11          30
2           2  ChedaJewel                   WW63  2014-12          31
3           3  ChedaJewel                   WW63   2014-9           9
4           4  ChedaJewel                   WW63   2015-1          31

In [96]:
rate = pd.read_csv('../data/intermediate/marin_trap_nights.csv')

marin = pd.merge(marin, rate, left_on= ['Deployment Location ID', 'Sampling Period'], how = 'inner',
         right_on = ['Deployment.Location.ID', 'Month'])
marin.head()

,Sampling Period,Project ID_x,Deployment Location ID,Species,Number of Animals,Year,Latitude,Longitude,Data Source,Unnamed: 0,Project.ID,Deployment.Location.ID,Month,Trapnights
0,2014-10,ChedaJewel,WW63,fuscipes,1,2014,38.043094,-122.749595,MARIN,0,ChedaJewel,WW63,2014-10,31
1,2014-10,ChedaJewel,WW63,griseus,1,2014,38.043094,-122.749595,MARIN,0,ChedaJewel,WW63,2014-10,31
2,2014-10,ChedaJewel,WW63,hemionus,1,2014,38.043094,-122.749595,MARIN,0,ChedaJewel,WW63,2014-10,31
3,2014-10,ChedaJewel,WW63,latrans,1,2014,38.043094,-122.749595,MARIN,0,ChedaJewel,WW63,2014-10,31
4,2014-10,ChedaJewel,WW63,lotor,2,2014,38.043094,-122.749595,MARIN,0,ChedaJewel,WW63,2014-10,31

In [97]:
marin['trap_days_per_100'] = marin['Trapnights']/100.
marin['Rate Of Detection'] = marin['Number of Animals']/marin['trap_days_per_100']

In [98]:
marin.head()

,Sampling Period,Project ID_x,Deployment Location ID,Species,Number of Animals,Year,Latitude,Longitude,Data Source,Unnamed: 0,Project.ID,Deployment.Location.ID,Month,Trapnights,trap_days_per_100,Rate Of Detection
0,2014-10,ChedaJewel,WW63,fuscipes,1,2014,38.043094,-122.749595,MARIN,0,ChedaJewel,WW63,2014-10,31,0.31,3.225806
1,2014-10,ChedaJewel,WW63,griseus,1,2014,38.043094,-122.749595,MARIN,0,ChedaJewel,WW63,2014-10,31,0.31,3.225806
2,2014-10,ChedaJewel,WW63,hemionus,1,2014,38.043094,-122.749595,MARIN,0,ChedaJewel,WW63,2014-10,31,0.31,3.225806
3,2014-10,ChedaJewel,WW63,latrans,1,2014,38.043094,-122.749595,MARIN,0,ChedaJewel,WW63,2014-10,31,0.31,3.225806
4,2014-10,ChedaJewel,WW63,lotor,2,2014,38.043094,-122.749595,MARIN,0,ChedaJewel,WW63,2014-10,31,0.31,6.451613

In [99]:
del marin['trap_days_per_100']
del marin['Trapnights']

marin['Sampling Type'] = 'Monthly'
marin.to_csv('../data/processed/rate_of_detection_MARIN.csv', index=False)